InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Ломбарды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Ломбарды</Name>
			<Comment>Ломбарды</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйФилиал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДневнойЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйЛимитВыдачиЗаймов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛомбарда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрефиксВНомереЗБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЛБ_ОтгрузкаПоНакладной/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НакладнаяНаОтгрузку") Тогда
		НакладнаяНаОтгрузку = Параметры.НакладнаяНаОтгрузку;    
		Ломбард = НакладнаяНаОтгрузку.Ломбард;
		ОтделениеЛомбарда = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДатаСеанса(), Ломбард); 
		ДатаОтгрузки = ТекущаяДатаСеанса();
		Получатель = Справочники.ЛБ_Ломбарды.ЦентральныйОфис; 
		Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
			СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
		КонецЕсли;	
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛомбардыОтделения() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(ТекущаяДатаСеанса(), ОтделениеЛомбарда, Ломбард); 
КонецФункции

&НаКлиенте
Процедура Отгрузить(Команда)
	ВсеОК = Истина;  
	Если НЕ ЗначениеЗаполнено(Инкассатор) Тогда
		ВсеОК = Ложь;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		ВсеОК = Ложь;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		ВсеОК = Ложь;
	КонецЕсли;	
	
	Если НЕ ВсеОК тогда
		Предупреждение("Необходимо заполнить все реквизиты на форме!", 60);
		Возврат;
	КонецЕсли;	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Инкассатор", Инкассатор);
	СтруктураВозврата.Вставить("Получатель", Получатель); 
	СтруктураВозврата.Вставить("СкладПолучатель", СкладПолучатель); 
	СтруктураВозврата.Вставить("ДатаОтгрузки", ДатаОтгрузки);
	СтруктураВозврата.Вставить("НакладнаяНаОтгрузку", НакладнаяНаОтгрузку);
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов() 
	МассивС = Новый Массив;
	Если Получатель = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда  
		МассивС.Добавить(ЛБ_Общиймодуль.ПолучитьСклад(Получатель, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО));   
	Иначе	
	    МассивС.Добавить(ЛБ_Общиймодуль.ПолучитьСклад(Получатель, Перечисления.ЛБ_ВидыСкладов.Залоги)); 
	КонецЕсли;
	Возврат МассивС; 
КонецФункции	

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь; 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолучателя",ЭтаФорма);
    Если ЗначениеЗаполнено(ОтделениеЛомбарда) Тогда 
		СписокВыбора = ПолучитьЛомбардыОтделения();  
		СписокВыбора.Вставить(0, ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис"));
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Ломбард); 

		Если ВыбранноеЗначение <> Неопределено Тогда 
		   Получатель = ВыбранноеЗначение.Значение;
		   Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
		   Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
			   СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
		   КонецЕсли;	
	   КонецЕсли;      
	Иначе	 
	    ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	
КонецПроцедуры    
	
&НаСервере
Процедура ПослеВыбораПолучателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;  
	
	Получатель = Результат; 
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ЗаполнитьСписокВыбораСкладов());
	Если Элементы.СкладПолучатель.СписокВыбора.Количество() = 1 Тогда
		СкладПолучатель = Элементы.СкладПолучатель.СписокВыбора.Получить(0).Значение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИнкассаторОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("СправочникСсылка.ЛБ_Сотрудники") Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ссылка", СформироватьМассивСотрудников());
		
		ПараметрФормы = Новый Структура;
		ПараметрФормы.Вставить("Отбор", СтруктураОтбора);
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникика", ЭтаФорма);
		
		ОткрытьФорму("Справочник.ЛБ_Сотрудники.ФормаВыбора", ПараметрФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьМассивСотрудников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&Дата, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В
		|			(ВЫБРАТЬ
		|				ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|			ИЗ
		|				РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|					(ВЫБРАТЬ
		|						ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|					ИЗ
		|						РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|			ГДЕ
		|				НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивВозврата = Новый Массив;
	
	Для каждого Стр Из Результат Цикл
		МассивВозврата.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораСотрудникика(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Инкассатор = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ИнкассаторНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Инкассатор = Неопределено;
КонецПроцедуры
